import 'package:flutter_bluetooth_serial_example/models/feature.dart';

class FirstCarFeatures {
  static final List<Feature> engineFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> performanceFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> interiorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> exteriorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> techFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
}

class SecondCarFeatures {
  static final List<Feature> engineFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> performanceFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> interiorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> exteriorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> techFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
}

class ThirdCarFeatures {
  static final List<Feature> engineFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> performanceFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> interiorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> exteriorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> techFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
}

class ForthCarFeatures {
  static final List<Feature> engineFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: '160 حصان وعزم دوران 240 نيوتن متر',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> performanceFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'سرعتها القصوى 220 km/h 0 - 100 في 7.5 ثانية',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> interiorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'المقاعد مريحة ومدعم جيدًا، كما أن مساحة الركاب واسعة ...',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> exteriorFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'يتميز التصميم الخارجي  بالجرأة والحداثة',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
  static final List<Feature> techFeatures = [
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
    Feature(
      id: 1,
      image: 'assets/images/car_image2.jpg',
      title: 'شاشة لمس مقاس 9.3 بوصة تعمل باللمس. والمزيد',
      subtitle:
          'تم تصميم ميجان الجديدة لتناسب من الداخل أيضًا! من مقصورة القيادة المستقبلية الحديثة ذات الميزات الذكية والمتصلة إلى فتحة السقف البانوراما والخامات عالية الجودة الأنيقة ، تمتع بمزيد من التكنولوجيا والراحة.',
    ),
  ];
}
